[{"description":"Create a premium steakhouse website for '100 Cerimónias Steakhouse' following the exact layout structure from the reference design at /home/user/scrape-muu/muusteakhousecompthome/screenshot.png. The website should have a dark, elegant theme with black background, gold/warm accents, and luxurious feel.\n\nStructure to follow (based on MUU Steakhouse layout):\n\n1. HERO SECTION: Full-width hero with a dramatic steak image (use ./8b93502b-3f37-4894-9695-18b59fe1c30e.jpg - brasa viva). Centered logo (use ./a3cfa0aa1472.png). Navigation menu with links: SOBRE NÓS | MENU | ATMOSFERA | A EQUIPA | CONTACTOS\n\n2. ABOUT/PASSION SECTION: Title 'SOMOS UNS APAIXONADOS' (like MUU's style). Text: 'No 100 Cerimónias Steakhouse, a carne é o centro de tudo. Selecionamos cortes premium, trabalhados com rigor, respeito pelo produto e uma obsessão clara pela qualidade. Aqui, cada prato é uma celebração do sabor, da textura e do ponto perfeito.' Add a stylized cow/bull graphic icon similar to MUU's colorful cow.\n\n3. MENU SECTION: Dark background with restaurant atmosphere image behind. Tabbed menu navigation with categories: Entradas | Na Brasa | Acompanhamentos | Sobremesas | Vinhos | Cocktails. Display menu items in a clean list format with item name, description, and price aligned right.\n\nMenu content for ENTRADAS tab:\n- Croquetes de Alheira - Croquetes crocantes de alheira tradicional portuguesa - €8,50\n- Tacos de Xixinha - Tacos recheados com carne desfiada temperada - €10,50\n- Ovos Rotos 100 Cerimónias (signature) - Ovos estrelados sobre batata frita com presunto - €13\n- Tártaro de Novilho - Carne de novilho picada à mão, temperada na hora - €15\n- Camarão 100 Cerimónias (signature) - Camarão grelhado com alho e ervas aromáticas - €12\n\nMenu content for NA BRASA tab:\n- Vazia (250gr) - Maturação de 22 dias - €28\n- Picanha (500gr) signature - Corte típico argentino com gordura lateral - €48\n- Txuletón (1kg) bestseller - Corte típico basco com osso - €79\n- Tomahawk (1kg) signature bestseller - Corte invulgar com osso extenso - €89\n- T-Bone (1kg) - Osso em T que separa vazia e lombo - €79\n- Tábua Premium 100 Cerimónias (2kg) signature - Carnes para todos os gostos - €172\n\nMenu content for ACOMPANHAMENTOS tab:\n- Batata Rústica (veggie) - €4,50\n- Salada Mista (veggie) - €4\n- Legumes Grelhados na Brasa (veggie) - €4,50\n- Arroz de Forno de Enchidos - €4\n- Puré de Batata Trufado (veggie) - €7,50\n\nMenu content for SOBREMESAS tab:\n- Bola de Gelado 100 Cerimónias - €4\n- Surpresa de Maracujá - €10\n- Fondant de Doce de Leite (bestseller) - €12\n- Brownie de Chocolate - €10\n\nMenu content for VINHOS tab:\nBrancos: Vale do Homem Aditivo €20, Contacto Alvarinho €28, Dote Simplesmente €22\nTintos: Zip Unoaked €20, Vale da Aldeia €26, Vallado €28, Loek's Grande Reserva €60\n\nMenu content for COCKTAILS tab:\nAssinatura (€12): Lick My Peach, Em Brasa, Special Mojito, Cerimónias Mule\nClássicos (€8): Margarita, Cosmopolitan, Mojito, Caipirinha, Negroni\n\n4. ATMOSFERA SECTION: Title 'ATMOSFERA' centered. Grid of 6 restaurant interior/food photos showing the ambiance. Use images: ./0d3ca745-bfea-410b-969b-7df83d9607af.jpg, ./85045d6c-1f52-42a3-8a59-565b62ec4b13.jpg, ./39e5e286-7685-49e6-893a-385744302fdb.jpg, ./99620f26-b610-42b4-a5bf-d0d7df4b54d9.jpg, ./1277703a-2b54-4bf2-ac50-a3cddc437347.jpg, ./a5e37b97-57ed-4949-8d6c-84ecde77bf38.jpg\n\n5. A EQUIPA SECTION: Title 'A EQUIPA 100 CERIMÓNIAS' centered. Introductory text about the team philosophy. Display 3 team member cards with photos (use food prep images as placeholders: ./1b8daf33-f44a-4004-9a78-9ac0575641d1.jpg for chef). Team members: Head Chef, Sommelier, Gerente - with short descriptions.\n\n6. CONTACTOS/FOOTER SECTION: Restaurant name '100 Cerimónias Steakhouse'. Address: Porto, Portugal. Established 2023. Phone for reservations. Email contact. Social media links (Facebook, Instagram, TripAdvisor icons). Faded logo at bottom.\n\nDesign notes: Use elegant serif fonts for headings, clean sans-serif for body. Gold/amber accent color (#D4AF37 or similar) on dark background. Smooth scroll navigation. Hover effects on menu items and images. Mobile responsive.","type":"feature","passes":true,"id":1},{"description":"Make the following updates to improve the website premium feel:\n\n1. REMOVE THE COLORFUL COW GRAPHIC completely from the 'Sobre Nós' section. Replace it with an elegant animated reservation button that links to https://resy.com/cities/porto-portugal/venues/100-cerimonias-steakhouse-premium. The button should have a subtle pulse/glow animation with gold border, text 'RESERVAR MESA' and be simple and elegant.\n\n2. ADD BILINGUAL TOGGLE (PT | EN) in the header navigation. When clicked, all text content should switch between Portuguese and English. Store the language preference.\n\n3. ANIMATE THE LOGO in the hero section - add a subtle elegant entrance animation (fade in with slight scale) and a gentle floating/breathing animation on hover. Add the slogan 'A arte da carne, servida com elegância' underneath the logo with a fade-in animation.\n\n4. UPDATE CONTACT INFORMATION with correct details:\n   - Address: Rua de Santo Ildefonso 210, 4000-507 Porto, Portugal\n   - Phone: +351 933 156 603\n   - Hours: Terça a Domingo | 19h00 – 00h00 (Encerrado à Segunda)\n   - Instagram: @100.cerimonias.steakhouse\n   - Reservation link: https://resy.com/cities/porto-portugal/venues/100-cerimonias-steakhouse-premium\n\n5. PREMIUM ENHANCEMENTS:\n   - Add subtle parallax effect on scroll for hero image\n   - Add elegant line separators between sections (thin gold lines)\n   - Add smooth reveal animations for menu items as they scroll into view\n   - Improve the gallery with a lightbox effect when clicking images\n   - Add a subtle grain/texture overlay for that premium steakhouse feel\n   - Make the navigation sticky with a blur backdrop effect when scrolling\n   - Add elegant hover effects on all interactive elements (scale, glow)\n   - Include a 'scroll to top' button that appears when scrolling down\n   - Add loading animation on page load (elegant fade in)\n\n6. Keep all the existing fonts (Cormorant Garamond for headings, Montserrat for body) and the gold/amber color scheme on dark background.","type":"feature","passes":true,"id":2},{"description":"Make these updates:\n\n1. UPDATE RESERVATION LINK: Change all reservation button links from the Resy URL to: tinyurl.com/100cerimonias\n\n2. ADD SECOND RESERVATION BUTTON: Add another elegant animated reservation button in a prominent location (e.g., in the hero section below the slogan, or as a floating button). Make it visually distinct but matching the premium style - could be a different animation style (e.g., shimmer effect instead of pulse).\n\n3. HERO IMAGE SLIDESHOW: Make the hero background image rotate/transition through multiple images automatically. Use these images in rotation:\n   - ./8b93502b-3f37-4894-9695-18b59fe1c30e.jpg (brasa viva)\n   - ./99620f26-b610-42b4-a5bf-d0d7df4b54d9.jpg (tomahawk being cut)\n   - ./1b2d7f29-bff0-4c2e-98b4-14c29160e462.jpg (stacked steaks)\n   - ./51921946-db12-4b63-b5e0-867f0d6e6b5e.jpg (raw tomahawk)\n   - ./a5e37b97-57ed-4949-8d6c-84ecde77bf38.jpg (sliced steak)\n   \n   The transition should be smooth and elegant (crossfade effect), changing every 5-6 seconds. Add subtle Ken Burns effect (slow zoom) on each image for cinematic feel.","type":"feature","passes":true,"id":3},{"description":"Update the website with the following changes:\n\n1. UPDATE DRINKS/COCKTAILS/WINES MENU with the exact content provided:\n\nDESTILADOS (Spirits):\n- VODKA: Grey Goose €10, Cîroc €10\n- RUM: Bacardi Carta Blanca €8, Bacardi 8 €12\n- GIN: Bombay Sapphire €10, Bombay Pressé €10, Bombay Bramble €10, Bulldog €11, Hendrick's €12, Bombay Premier Cru €13, Monkey 47 €15\n- WHISKY: Dewar's 8 €8, Johnnie Walker Red Label €8, Jack Daniel's Apple €10, Jack Daniel's Honey €10, Jack Daniel's Tennessee €10, Dewar's 21 €12, Jack Daniel's Single Barrel €12, Cutty Sark Discovery 18 €13\n- CONHAQUE (Cognac): Hubert Rocheeboit Fine €10, Courvoisier VSOP €23\n- VERMUTES (Vermouth): Martini Special Rubino €8, Martini Special Ambrato €8\n- TEQUILA: Patrón Silver €10\n\nCERVEJAS (Beers): Stella Artois €3,50, Leffe Blond €5,50, Franziskaner €5,50\n\nSUMOS NATURAIS (Natural Juices): Limonada €3, Sumo de Laranja Natural €4\n\nREFRIGERANTES (Soft Drinks): Coca Cola €3, Coca Cola Zero €3, Nestea Pêssego €3, Água Tónica €3, Ginger Beer €3, Ginger Ale €3\n\nSANGRIAS:\n- Espumante €35 (Maracujá, frutos vermelhos, maçã, mojito)\n- Magic Bubbles (Mimadu) €40\n- Champagne 100 Cerimónias - Preço s/ consulta\n\nCOCKTAILS ASSINATURA €12 each:\n- Lick My Peach: Vodka, licor de laranja, citrinos, pêssego, clara de ovo\n- Em Brasa: Gin, puré de morango, sumo de laranja, soda e angustura\n- Special Mojito: Vinho do Porto branco, tangerina, ginger ale, citrinos, hortelã\n- Cerimónias Mule: Vodka, ginger beer, citrinos, espuma de gengibre\n- Afrodite: Vodka, licor de laranja, maracujá, framboesa, citrinos, clara de ovo\n- Invicta: Vodka, blue curaçao, sumo de laranja, sumo de arando\n\nCOCKTAILS CLÁSSICOS €8 each: Margarita, Cosmopolitan, Mojito, Caipirinha, Pornstar Martini, Negroni, Espresso Martini, Old Fashioned, Daiquiri, Aperol Spritz\n\nMOCKTAILS €5 each:\n- Belle Vie: Abacaxi, sumo de lima, cereja marrasquino, puré de pêssego\n- Ginger Swizzle: Sumo de limão, xarope de gengibre, soda\n- Raspberry Fizz: Menta fresca, framboesa, sumo de limão e ginger-ale\n\nAdd note at bottom: 'Todos os preços incluem IVA à taxa legal em vigor' / 'All prices include VAT'\n\n2. IMPROVE MENU ORGANIZATION AND INTERACTIVITY:\n- Make the menu more visually organized with clear category headers\n- Add collapsible/expandable sections for each drink category\n- Add smooth animations when expanding/collapsing\n- Add icons for each category (wine glass, cocktail, beer, etc.)\n- Make items hoverable with subtle highlight effect\n\n3. UPDATE SOCIAL MEDIA AND CONTACT INFO:\n- Instagram: @100cerimonias.steakhouse (link to https://instagram.com/100cerimonias.steakhouse)\n- Address: Rua de Santo Ildefonso, 210, Porto\n- Add Google Reviews link (search for 100 Cerimónias Steakhouse Premium Porto on Google Maps)\n- Add 'Livro de Reclamações' link (https://www.livroreclamacoes.pt/)\n\n4. Add these links in the footer with icons:\n- Instagram icon with @100cerimonias.steakhouse\n- Google Reviews icon/link\n- Livro de Reclamações link (Portuguese legal requirement)","type":"feature","passes":true,"id":4},{"description":"Update the 'Sobre Nós' (About) section:\n\n1. CHANGE THE TITLE from 'SOMOS UNS APAIXONADOS' to 'SOBRE O GRUPO' (English: 'ABOUT THE GROUP')\n\n2. REPLACE THE TEXT with the following new content:\n\nPortuguese:\n'Somos um grupo de pessoas que se juntaram e que tentam fazer a vida valer da melhor maneira que conseguimos. Completamente diferentes, conseguimos encontrar o nosso equilíbrio e todas as noites conseguimos entregar refeições onde o objetivo é sempre um sorriso na cara das pessoas.\n\nCriámos um espaço elegante, confortável e sem cerimónias desnecessárias, onde o foco está na partilha — de comida, emoções e momentos.\n\nInspiramo-nos nas grandes steakhouses internacionais, mas mantemos uma identidade própria, enraizada no Porto — uma cidade de carácter, tradição e autenticidade. Acreditamos que a excelência não precisa de excessos — precisa de consistência, conhecimento e paixão.'\n\nEnglish translation:\n'We are a group of people who came together trying to make life worthwhile in the best way we can. Completely different, we found our balance and every night we deliver meals where the goal is always a smile on people's faces.\n\nWe created an elegant, comfortable space without unnecessary ceremonies, where the focus is on sharing — food, emotions and moments.\n\nWe are inspired by the great international steakhouses, but we maintain our own identity, rooted in Porto — a city of character, tradition and authenticity. We believe that excellence doesn't need excess — it needs consistency, knowledge and passion.'","type":"feature","passes":true,"id":5},{"description":"Remove the 'RESERVAR MESA' (Book a Table) button that appears above the 'SOBRE O GRUPO' (About the Group) section. Keep only the reservation button in the hero section and in the footer.","type":"feature","passes":true,"id":6},{"description":"Update the Google Reviews link to: https://g.page/r/Ccra-11PcYKrEAE/review\n\nAlso replace the current Google Reviews icon with an actual Google 'G' logo (the colorful Google G icon with red, yellow, green, blue colors). Make it recognizable as the official Google logo. Keep the link text as 'Google Reviews' / 'Avaliações Google' next to the logo.","type":"feature","passes":true,"id":7},{"description":"Update the social media links:\n\n1. UPDATE INSTAGRAM LINK to: https://www.instagram.com/100.cerimonias.steakhouse/\n\n2. ADD FACEBOOK LINK: https://www.facebook.com/p/100-Cerim%C3%B3nias-61552994880023/\n   - Add a Facebook icon (the 'f' logo) next to Instagram in the social media section\n   - Include it in both the footer social links area and anywhere else Instagram appears","type":"feature","passes":true,"id":8},{"description":"Replace the current logo image (a3cfa0aa1472.png) with the new transparent background version (logo-transparent.png) everywhere it appears on the website - in the hero section and in the footer.","type":"feature","passes":true,"id":9},{"description":"Make the logo larger in the hero section and display it in a square format/container. Increase the logo size significantly so it's more prominent and impactful. Keep the logo centered and maintain the transparent background.","type":"feature","passes":true,"id":10},{"description":"Apply text content changes to the About section:\n\n1. Change the second paragraph from:\n'Criámos um espaço elegante, confortável e sem cerimónias desnecessárias, onde o foco está na partilha — de comida, emoções e momentos.'\n\nTo:\n'Criámos um espaço elegante, confortável e sem cerimónias desnecessárias, onde o foco está na partilha de comida, emoções e momentos.'\n(Remove the em dash before 'de comida')\n\n2. Change the third paragraph from:\n'Inspiramo-nos nas grandes steakhouses internacionais, mas mantemos uma identidade própria, enraizada no Porto — uma cidade de carácter, tradição e autenticidade. Acreditamos que a excelência não precisa de excessos — precisa de consistência, conhecimento e paixão.'\n\nTo:\n'Inspiramo-nos nas grandes steakhouses internacionais, mas mantemos uma identidade própria, enraizada no Porto, uma cidade de carácter, tradição e autenticidade. Acreditamos que a excelência não precisa de excessos, precisa de consistência, conhecimento e paixão.'\n(Replace em dashes with commas)","type":"feature","passes":true,"id":11},{"description":"Update the wines menu (Vinhos tab) with the following exact content:\n\nVINHOS BRANCOS (White Wines):\n- Vale do Homem Arinto (Vinho Verde) - €20\n- Contacto Alvarinho - €28\n- Dote Simplesmente Batonnage (Douro) - €22\n- Quinta Vale D'Aldeia Grande (Douro) - €45\n\nVINHOS TINTOS (Red Wines):\n- ZIP Unoaked (Douro) - €20\n- Vale da Aldeia (Douro) - €20\n- Vallado (Douro) - €28\n- Loek's Grande Reserva (Douro) - €60\n- Quinta da Lapa Pinot Noir Reserva (Tejo) - €28\n- Quinta da Lapa Reserva Cabernet Sauvignon (Tejo) - €28\n- Quinta do Paral (Alentejo) - €32\n\nROSÉ:\n- Quinta do Paral - €25\n\nESPUMANTE (Sparkling):\n- Lagoa Velha (Bairrada) - €22\n\nVINHO A COPO (Wine by the Glass):\n- Vale do Homem Arinto (Vinho Verde) - €6\n- Dote Simplesmente Batonnage (Maduro Branco Douro) - €6\n- Zip Unoaked (Maduro Tinto Douro) - €6\n\nNote: Remove any duplicate entries and make sure all wines are correctly categorized.","type":"feature","passes":true,"id":12},{"description":"Remove the 'A Equipa' (Team) section completely from the website. Also remove the 'A Equipa' link from the navigation menu. We will add it back later when we have the team photos.","type":"feature","passes":true,"id":13},{"description":"Reduce the font size of the text in the 'Sobre o Grupo' (About) section. Make the paragraph text smaller for a more refined, elegant look.","type":"feature","passes":true,"id":14},{"description":"Add a background image slideshow to the Menu section (the bottom part/background of the menu area). Use the restaurant interior and food images to create an atmospheric background that rotates automatically. Use images like:\n- ./0d3ca745-bfea-410b-969b-7df83d9607af.jpg (dining room with neon)\n- ./39e5e286-7685-49e6-893a-385744302fdb.jpg (bar area)\n- ./85045d6c-1f52-42a3-8a59-565b62ec4b13.jpg (wine cellar with neon)\n- ./1277703a-2b54-4bf2-ac50-a3cddc437347.jpg (dining room)\n\nThe slideshow should have:\n- Smooth crossfade transitions between images\n- Images changing every 5-6 seconds\n- Dark overlay to ensure menu text remains readable\n- Subtle Ken Burns effect (slow zoom) for cinematic feel\n- Similar implementation to the hero slideshow","type":"feature","passes":true,"id":15},{"description":"Make the following structural changes to the website:\n\n1. REMOVE the 'Sobre o Grupo' (About) section from the main page completely - remove both the section and its navigation link from the main nav.\n\n2. CREATE A SEPARATE 'SOBRE NÓS' PAGE accessible via the navigation. This page should:\n   - Have a similar dark elegant design matching the site\n   - Include the full 'Sobre o Grupo' content (the 3 paragraphs about the team)\n   - Have a hero section with one of the restaurant images as background\n   - Include a 'Voltar' (Back) button or link to return to the main page\n   - Keep the same fonts and gold/amber color scheme\n\n3. UPDATE NAVIGATION:\n   - Change 'SOBRE NÓS' link to navigate to the new separate page instead of scrolling\n   - Keep: SOBRE NÓS | MENU | ATMOSFERA | CONTACTOS in the nav\n   - SOBRE NÓS should link to the new page\n   - MENU, ATMOSFERA, CONTACTOS should scroll on the main page\n\n4. MAKE MENU THE MAIN ATTRACTION on the homepage:\n   - The homepage should now start with the Hero, then go directly to Menu section\n   - Menu should be prominently featured as the first content section after hero","type":"feature","passes":true,"id":16},{"description":"Change all instances of 'Sobre o Grupo' to 'Sobre o Restaurante' throughout the website, including:\n- Page titles\n- Navigation links\n- Headings\n- Both Portuguese and English translations (English: 'About the Restaurant')","type":"feature","passes":true,"id":17},{"description":"Update the menu item descriptions with the following changes:\n\nENTRADAS:\n- Croquetes de Alheira: Change description to 'Croquetes de alheira de Mirandela e queijo da serra'\n- Tacos de Xixinha: Change description to 'Tacos com carne e maionese de sriracha'\n- Ovos Rotos 100 Cerimónias: Change description to 'Batata frita caseira, linguiça, presunto nove meses de cura e trufa'\n- Tártaro de Novilho: Change description to 'Pickles, rabanete e tostas caseiras'\n- Camarão 100 Cerimónias: Change description to 'Camarão panado e maionese de sriracha'\n\nNA BRASA:\n- Vazia Black Angus: Change description to 'Suculento!'\n- Picanha: Keep name as 'Picanha Black Angus' (update if needed)\n- Txuletón: Change description to 'Corte grande com osso'\n- Tomahawk: Change description to 'Corte com forma de machado, tenro e saboroso'\n- Tábua Premium 100 Cerimónias: Change description to '500g de vazia black angus, 500g de picanha, 1kg de tomahawk'\n\nMake sure to update both Portuguese and English translations where applicable.","type":"feature","passes":true,"id":18},{"description":"Update the menu with the following changes:\n\n1. REMOVE THESE ITEMS:\n- SANGRIAS: Remove 'Magic Bubbles (Mimadu)' and 'Champagne 100 Cerimónias'\n- COCKTAILS ASSINATURA: Remove 'Em Brasa' and 'Invicta'\n- VINHOS TINTOS: Remove 'Vallado'\n- SUMOS NATURAIS: Remove 'Limonada' and 'Sumo de Laranja Natural' (remove entire category if empty)\n- MOCKTAILS: Remove 'Belle Vie' and 'Ginger Swizzle' (keep only Raspberry Fizz)\n- COCKTAILS CLÁSSICOS: Remove ALL items (Margarita, Cosmopolitan, Mojito, Caipirinha, Pornstar Martini, Negroni, Espresso Martini, Old Fashioned, Daiquiri, Aperol Spritz) - remove entire category\n\n2. UPDATE PRICES (new prices from PDF with +30% increase, rounded):\n\nENTRADAS:\n- Croquetes de Alheira: €16 (was 12.50 + 30%)\n- Tacos de Xixinha: €19 (was 14.50 + 30%)\n- Ovos Rotos 100 Cerimónias: €23 (was 18 + 30%)\n- Tártaro de Novilho: €25 (was 19 + 30%)\n- Camarão 100 Cerimónias: €14 (was 11 + 30%)\n\nNA BRASA:\n- Vazia Black Angus (250g): €42 (was 32 + 30%)\n- Picanha Black Angus (500g): €77 (was 59 + 30%)\n- Add new item: Costeleta Vazia Baixa (500g) - 'Vazia baixa com osso' - €77\n- Txuletón (1kg): €117 (was 90 + 30%)\n- Tomahawk (1kg): €104 (was 80 + 30%)\n- T-Bone (1kg): €117 (was 90 + 30%)\n- Tábua Premium (2kg): €247 (was 190 + 30%) - update description to '1kg Tomahawk, 500g vazia, 500g picanha'\n\nACOMPANHAMENTOS/GUARNIÇÕES:\n- Salada: €8 (was 6 + 30%)\n- Arroz de Forno de Enchidos: €8\n- Batata Frita Rústica: €8\n- Puré de Batata Trufado: €9 (was 7 + 30%)\n- Legumes Grelhados: €8 (was 6 + 30%) - update name to 'Legumes Grelhados com Redução de Vinho'\n- Add: Tagliatelle Legumes e Pesto - €33 (was 25 + 30%)\n\nSOBREMESAS:\n- Bola de Gelado: €7 (was 5 + 30%)\n- Surpresa de Maracujá: €16 (was 12 + 30%)\n- Fondant de Doce de Leite: €17 (was 13 + 30%)\n- Brownie de Chocolate: €17 (was 13 + 30%)\n\nVINHOS (keep +30%):\n- Brancos: Vale do Homem Arinto €26, Contacto Alvarinho €36, Dote Simplesmente €29, Quinta Vale D'Aldeia Grande €59\n- Tintos: ZIP Unoaked €26, Vale da Aldeia €26, Loek's Grande Reserva €78, Quinta da Lapa Pinot Noir €36, Quinta da Lapa Cabernet €36, Quinta do Paral €42\n- Rosé: Quinta do Paral €33\n- Espumante: Lagoa Velha €29\n- Vinho a Copo: all €8\n\nCOCKTAILS ASSINATURA (keep only 4): €16 each\n- Lick My Peach\n- Special Mojito\n- Cerimónias Mule\n- Afrodite\n\nMOCKTAILS: €7 each\n- Raspberry Fizz (only one remaining)\n\nSANGRIAS:\n- Espumante: €46 (was 35 + 30%)\n\nCERVEJAS (+30%):\n- Stella Artois: €5\n- Leffe Blond: €7\n- Franziskaner: €7\n\nDESTILADOS (+30% on all prices)","type":"feature","passes":true,"id":19},{"description":"Update menu item badges:\n1. Remove the 'signature' badge from 'Camarão 100 Cerimónias'\n2. Add 'bestseller' badge to 'Ovos Rotos 100 Cerimónias'","type":"feature","passes":true,"id":20},{"description":"Update all menu prices based on the PDF prices (ignore the 30% increase). Use these exact prices:\n\nENTRADAS:\n- Croquetes de Alheira: €12.50\n- Tacos de Xixinha: €14.50\n- Ovos Rotos 100 Cerimónias: €18\n- Tártaro de Novilho: €19\n- Camarão 100 Cerimónias: €11\n\nNA BRASA:\n- Vazia Black Angus (250g): €32\n- Picanha Black Angus (500g): €59\n- Costeleta Vazia Baixa (500g): €59\n- Txuletón (1kg): €90\n- Tomahawk (1kg): €80\n- T-Bone (1kg): €90\n- Tábua Premium (2kg): €190\n\nAACOMPANHAMENTOS/GUARNIÇÕES:\n- Salada: €6\n- Arroz de Forno de Enchidos: €6\n- Batata Frita Rústica: €6\n- Puré de Batata Trufado: €7\n- Legumes Grelhados com Redução de Vinho: €6\n- Tagliatelle Legumes e Pesto: €25\n\nSOBREMESAS:\n- Bola de Gelado: €5\n- Surpresa de Maracujá: €12\n- Fondant de Doce de Leite: €13\n- Brownie de Chocolate: €13","type":"feature","passes":true,"id":21},{"description":"Revert all drinks prices to the original prices before the 30% increase:\n\nVINHOS BRANCOS:\n- Vale do Homem Arinto: €20\n- Contacto Alvarinho: €28\n- Dote Simplesmente Batonnage: €22\n- Quinta Vale D'Aldeia Grande: €45\n\nVINHOS TINTOS:\n- ZIP Unoaked: €20\n- Vale da Aldeia: €20\n- Loek's Grande Reserva: €60\n- Quinta da Lapa Pinot Noir Reserva: €28\n- Quinta da Lapa Reserva Cabernet Sauvignon: €28\n- Quinta do Paral: €32\n\nROSÉ:\n- Quinta do Paral: €25\n\nESPUMANTE:\n- Lagoa Velha: €22\n\nVINHO A COPO:\n- Vale do Homem Arinto: €6\n- Dote Simplesmente Batonnage: €6\n- Zip Unoaked: €6\n\nSANGRIAS:\n- Espumante: €35\n\nCOCKTAILS ASSINATURA:\n- All: €12 each\n\nMOCKTAILS:\n- Raspberry Fizz: €5\n\nCERVEJAS:\n- Stella Artois: €3,50\n- Leffe Blond: €5,50\n- Franziskaner: €5,50\n\nDESTILADOS (revert to original):\n- Grey Goose: €10\n- Cîroc: €10\n- Bacardi Carta Blanca: €8\n- Bacardi 8: €12\n- Bombay Sapphire: €10\n- Bombay Pressé: €10\n- Bombay Bramble: €10\n- Bulldog: €11\n- Hendrick's: €12\n- Bombay Premier Cru: €13\n- Monkey 47: €15\n- Dewar's 8: €8\n- Johnnie Walker Red Label: €8\n- Jack Daniel's Apple: €10\n- Jack Daniel's Honey: €10\n- Jack Daniel's Tennessee: €10\n- Dewar's 21: €12\n- Jack Daniel's Single Barrel: €12\n- Cutty Sark Discovery 18: €13\n- Hubert Rocheeboit Fine: €10\n- Courvoisier VSOP: €23\n- Martini Special Rubino: €8\n- Martini Special Ambrato: €8\n- Patrón Silver: €10\n\nREFRIGERANTES:\n- Coca Cola: €3\n- Coca Cola Zero: €3\n- Nestea Pêssego: €3\n- Água Tónica: €3\n- Ginger Beer: €3\n- Ginger Ale: €3","type":"feature","passes":true,"id":22},{"description":"Update all refrigerante prices from €3 to €3,50:\n- Coca Cola: €3,50\n- Coca Cola Zero: €3,50\n- Nestea Pêssego: €3,50\n- Água Tónica: €3,50\n- Ginger Beer: €3,50\n- Ginger Ale: €3,50","type":"feature","passes":true,"id":23},{"description":"Add back the 'Feijão' (beans) item to the Acompanhamentos/Guarnições section. Add it as: Feijão - €6 (or appropriate price)","type":"feature","passes":true,"id":24},{"description":"Update the Feijão item:\n1. Change the description to 'Feijão preto com enchidos'\n2. Remove the 'veggie' badge/reference from this item","type":"feature","passes":true,"id":25},{"description":"Create a new PASTA section in the menu with the following item:\n\nPASTA:\n- Tagliatelle do Bosque\n  Portuguese: Molho de pesto com legumes\n  English: Forest Tagliatelle with pesto sauce and grilled vegetables\n  Price: €25\n\nInsert this section after the ACOMPANHAMENTOS and before SOBREMESAS section. Keep the same style and formatting as other menu sections.","type":"feature","passes":true,"id":26}]