[{"description":"Create a premium steakhouse website for '100 Cerimónias Steakhouse' following the exact layout structure from the reference design at /home/user/scrape-muu/muusteakhousecompthome/screenshot.png. The website should have a dark, elegant theme with black background, gold/warm accents, and luxurious feel.\n\nStructure to follow (based on MUU Steakhouse layout):\n\n1. HERO SECTION: Full-width hero with a dramatic steak image (use ./8b93502b-3f37-4894-9695-18b59fe1c30e.jpg - brasa viva). Centered logo (use ./a3cfa0aa1472.png). Navigation menu with links: SOBRE NÓS | MENU | ATMOSFERA | A EQUIPA | CONTACTOS\n\n2. ABOUT/PASSION SECTION: Title 'SOMOS UNS APAIXONADOS' (like MUU's style). Text: 'No 100 Cerimónias Steakhouse, a carne é o centro de tudo. Selecionamos cortes premium, trabalhados com rigor, respeito pelo produto e uma obsessão clara pela qualidade. Aqui, cada prato é uma celebração do sabor, da textura e do ponto perfeito.' Add a stylized cow/bull graphic icon similar to MUU's colorful cow.\n\n3. MENU SECTION: Dark background with restaurant atmosphere image behind. Tabbed menu navigation with categories: Entradas | Na Brasa | Acompanhamentos | Sobremesas | Vinhos | Cocktails. Display menu items in a clean list format with item name, description, and price aligned right.\n\nMenu content for ENTRADAS tab:\n- Croquetes de Alheira - Croquetes crocantes de alheira tradicional portuguesa - €8,50\n- Tacos de Xixinha - Tacos recheados com carne desfiada temperada - €10,50\n- Ovos Rotos 100 Cerimónias (signature) - Ovos estrelados sobre batata frita com presunto - €13\n- Tártaro de Novilho - Carne de novilho picada à mão, temperada na hora - €15\n- Camarão 100 Cerimónias (signature) - Camarão grelhado com alho e ervas aromáticas - €12\n\nMenu content for NA BRASA tab:\n- Vazia (250gr) - Maturação de 22 dias - €28\n- Picanha (500gr) signature - Corte típico argentino com gordura lateral - €48\n- Txuletón (1kg) bestseller - Corte típico basco com osso - €79\n- Tomahawk (1kg) signature bestseller - Corte invulgar com osso extenso - €89\n- T-Bone (1kg) - Osso em T que separa vazia e lombo - €79\n- Tábua Premium 100 Cerimónias (2kg) signature - Carnes para todos os gostos - €172\n\nMenu content for ACOMPANHAMENTOS tab:\n- Batata Rústica (veggie) - €4,50\n- Salada Mista (veggie) - €4\n- Legumes Grelhados na Brasa (veggie) - €4,50\n- Arroz de Forno de Enchidos - €4\n- Puré de Batata Trufado (veggie) - €7,50\n\nMenu content for SOBREMESAS tab:\n- Bola de Gelado 100 Cerimónias - €4\n- Surpresa de Maracujá - €10\n- Fondant de Doce de Leite (bestseller) - €12\n- Brownie de Chocolate - €10\n\nMenu content for VINHOS tab:\nBrancos: Vale do Homem Aditivo €20, Contacto Alvarinho €28, Dote Simplesmente €22\nTintos: Zip Unoaked €20, Vale da Aldeia €26, Vallado €28, Loek's Grande Reserva €60\n\nMenu content for COCKTAILS tab:\nAssinatura (€12): Lick My Peach, Em Brasa, Special Mojito, Cerimónias Mule\nClássicos (€8): Margarita, Cosmopolitan, Mojito, Caipirinha, Negroni\n\n4. ATMOSFERA SECTION: Title 'ATMOSFERA' centered. Grid of 6 restaurant interior/food photos showing the ambiance. Use images: ./0d3ca745-bfea-410b-969b-7df83d9607af.jpg, ./85045d6c-1f52-42a3-8a59-565b62ec4b13.jpg, ./39e5e286-7685-49e6-893a-385744302fdb.jpg, ./99620f26-b610-42b4-a5bf-d0d7df4b54d9.jpg, ./1277703a-2b54-4bf2-ac50-a3cddc437347.jpg, ./a5e37b97-57ed-4949-8d6c-84ecde77bf38.jpg\n\n5. A EQUIPA SECTION: Title 'A EQUIPA 100 CERIMÓNIAS' centered. Introductory text about the team philosophy. Display 3 team member cards with photos (use food prep images as placeholders: ./1b8daf33-f44a-4004-9a78-9ac0575641d1.jpg for chef). Team members: Head Chef, Sommelier, Gerente - with short descriptions.\n\n6. CONTACTOS/FOOTER SECTION: Restaurant name '100 Cerimónias Steakhouse'. Address: Porto, Portugal. Established 2023. Phone for reservations. Email contact. Social media links (Facebook, Instagram, TripAdvisor icons). Faded logo at bottom.\n\nDesign notes: Use elegant serif fonts for headings, clean sans-serif for body. Gold/amber accent color (#D4AF37 or similar) on dark background. Smooth scroll navigation. Hover effects on menu items and images. Mobile responsive.","type":"feature","passes":true,"id":1}]
